app/interactors/calculate_account_balance.rb

  def call
    account = context.account

    deposits = Deposit.where(account_id: account.id).sum(:amount)
    withdrawals = Withdrawal.where(account_id: account.id).sum(:amount)
    received = Transaction.where(to_account_id: account.id).sum(:amount)
    sent = Transaction.where(from_account_id: account.id).sum(:amount)
---
SELECT SUM("deposits"."amount") FROM "deposits" WHERE "deposits"."account_id" = 5
SELECT SUM("withdrawals"."amount") FROM "withdrawals" WHERE "withdrawals"."account_id" = 5
SELECT SUM("transactions"."amount") FROM "transactions" WHERE "transactions"."to_account_id" = 5
SELECT SUM("transactions"."amount") FROM "transactions" WHERE "transactions"."from_account_id" = 5