app/interactors/create_withdrawal.rb

INSERT INTO "withdrawals" ("banking_facility_id", "account_id", "amount", "created_at", "updated_at") VALUES (1, 5, 50.0, '2026-04-11 12:32:26.299441', '2026-04-11 12:32:26.299441') RETURNING "id"
---
  def call
    withdrawal = Withdrawal.new(
      banking_facility_id: context.banking_facility_id,
      account_id: context.account_id,
      amount: context.amount
    )

    if withdrawal.save