app/interactors/create_account.rb

INSERT INTO "accounts" ("first_name", "last_name", "created_at", "updated_at", "iban", "country_code") VALUES ('User', 'Tester', '2026-04-11 11:03:22.133795', '2026-04-11 11:03:22.133795', 'GB10TKRG43999900514824', 'GB') RETURNING "id"
---
  def call
    account = Account.new(context.account_params)
    account.user = context.user
    account.iban = generate_iban

    if account.save