app/interactors/create_deposit.rb

INSERT INTO "deposits" ("banking_facility_id", "account_id", "amount", "created_at", "updated_at") VALUES (1, 5, 300.0, '2026-04-11 12:13:24.694823', '2026-04-11 12:13:24.694823') RETURNING "id"
---
  def call
    deposit = Deposit.new(
      banking_facility_id: context.banking_facility_id,
      account_id: context.account_id,
      amount: context.amount
    )

    if deposit.save