app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 5 LIMIT 1
---
  def show
    account = Account.find(params[:id])