app/controllers/application_controller.rb

SELECT "banking_facilities".* FROM "banking_facilities" WHERE "banking_facilities"."api_key_digest" = '61d85573c46bd495c9d744ae910f4acd85b9c53aed46984b8e3b9c78205ab05a' LIMIT 1
---
  def authenticate_banking_facility
    @current_banking_facility = authenticate_with_http_token do |token, _|
      hashed = Digest::SHA256.hexdigest(token)
      BankingFacility.find_by(api_key_digest: hashed)