app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("from_account_id", "to_account_id", "amount", "created_at", "updated_at") VALUES (1, 5, 100.0, '2026-04-11 09:32:14.829245', '2026-04-11 09:32:14.829245') RETURNING "id"
---
  def create
    @transaction = Transaction.new(transaction_params)
    if @transaction.save